---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextColor
source: html/7645e982-5867-da9a-9eae-28a2e31181d4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextColor Property

"Color"

## Syntax (C#)
```csharp
public static ForgeTypeId TextColor { get; }
```